## Brewfile

# Taps
tap 'Homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'sambadevi/powerlevel9k'
tap 'graphite'

# Basics
brew 'ack'
brew 'ctop'
brew 'docker'
brew 'htop'
brew 'httpie'
brew 'postgresql'
brew 'powerlevel9k'
brew 'wget'

# Programming
brew 'awscli'
brew 'git'
brew 'jq'
brew 'R'
brew 'rbenv'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'diff-so-fancy'
brew 'emacs'
brew 'terraform'
brew 'docker-sync'
brew 'node'
brew 'nodenv'
brew 'git-lfs'
brew 'warrensbox/tap/tfswitch'
brew 'pre-commit'
brew 'terraform-docs'
brew 'tflint'
brew 'ghp'
brew 'pyenv-virtualenvwrapper'
brew 'supabase'  # Fixed missing quote here
brew 'zsh-autosuggestions'

## Caskfile
cask '1password'
cask 'alfred'
cask 'visual-studio-code'
cask 'chrome-devtools'
# cask 'dropbox'
# cask 'google-chrome'
cask 'java'
cask 'jing'
cask 'ngrok'
cask 'flash-player'
cask 'flux'
cask 'iterm2'
cask 'rstudio'
cask 'spectacle'
cask 'spotify'
cask 'vlc'
cask 'aerial'
cask 'postico'
cask 'dbeaver'
cask 'warp'
cask 'cursor'
cask 'signal'
cask 'chatgpt'
cask 'figma'
cask 'ollama'

# Fonts
cask 'font-hack-nerd-font'
# the ones below don't work 4/2022
#cask 'font-droidsansmono-nerd-font'
#cask 'font-droidsansmono-nerd-font-mono'
#cask 'font-droid-sans-mono-for-powerline'
#cask 'font-hack-nerd-font'
