## Brewfile

# Taps
tap 'Homebrew/bundle'
tap 'caskroom/fonts'
tap 'sambadevi/powerlevel9k'

# Basics
brew 'ack'
brew 'ctop'
brew 'docker'
brew 'htop'
brew 'httpie'
brew 'postgresql'
brew 'powerlevel9k'
brew 'wget'

# Programming
# brew 'git'
brew 'jq'
brew 'R'
brew 'rbenv'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'diff-so-fancy'
brew 'emacs'
brew 'terraform'
brew 'docker-sync'
brew 'nodenv'
brew 'git-lfs'
brew 'warrensbox/tap/tfswitch'
brew 'pre-commit'
break 'terraform-docs'
brew 'tflint'
# brew 'pyenv-virtualenvwrapper'


## Caskfile
cask '1password'
cask 'alfred'
cask 'visual-studio-code'
cask 'chrome-devtools'
# cask 'dropbox'
# cask 'google-chrome'
cask 'java'
cask 'jing'
cask 'ngrok'
cask 'flash-player'
cask 'flux'
cask 'iterm2'
cask 'rstudio'
# cask 'slack' #  - use App Store
cask 'spectacle'
cask 'spotify'
cask 'vlc'
cask 'aerial'
cak 'postico'

# Fonts
cask 'font-droidsansmono-nerd-font'
cask 'font-droidsansmono-nerd-font-mono'
cask 'font-droid-sans-mono-for-powerline'
cask 'font-hack-nerd-font'
